<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"006d33243a6ce6674bad60dec00fef0e2ce71b719ec7b8b180e8a65e99a64aed","plan_job_ref":"Job Create terraform plan #20 at https://github.com/coforma/co-boomi-atom-fargate/actions/runs/6593467959","plan_hash":"3a63e1ab8c420973976180c6f23c8eaab29c4fd9d9a3e36d12fad40875eeca69","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __.__
<details>
<summary>Plan: 3 to add, 1 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/46b6292ead948f1e82fa21b4ec1c1bb3e42a13cf5093b8ae69df2ac872bfd24a.zip" -> "builds/615ce8f8290748ad73e6a609784430cd882136c61c455903e8b846c44102ffbb.zip"
        id                             = "co-boomi-atom-secret-install-lambda"
      ~ last_modified                  = "2023-10-17T09:14:32.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:13" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:13/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "13" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_permission.current_version_triggers["secrets"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "*******" -> (known after apply)
      ~ qualifier           = "13" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "./lambda/rotate_install_token.py",
                      + null,
                    ],
                  + [
                      + "zip",
                      + "./lambda/package/",
                      + null,
                    ],
                ]
              + filename      = "builds/615ce8f8290748ad73e6a609784430cd882136c61c455903e8b846c44102ffbb.zip"
              + runtime       = "python3.11"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/615ce8f8290748ad73e6a609784430cd882136c61c455903e8b846c44102ffbb.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "*******************" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/46b6292ead948f1e82fa21b4ec1c1bb3e42a13cf5093b8ae69df2ac872bfd24a.zip" -> "builds/615ce8f8290748ad73e6a609784430cd882136c61c455903e8b846c44102ffbb.zip"
          ~ "timestamp" = "1697534054460439000" -> "1697842709167395200"
        }
    }

Plan: 3 to add, 1 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #20](https://github.com/coforma/co-boomi-atom-fargate/actions/runs/6593467959)